# git init  превращает директорию в гит репозиторий (создается .git) 
# git add . отслеживание всех файлов (если все файлы можно указать отдельные файлы)
# git commit -m "commit" добавляет/ совершает сохранение в гит всех файлов, которые находяся  в индексе>
# git log выводит журнал(log) сохранений
# git status  показывает статус файлов
# git remote add origin(название связи-обфчно origin) SSH(ссылка на удвление)
# git checkout hash_commit  просматриваем версию
# git branch   выводит в терминал список всех веток (звездочкой помечена активная ветка)
# git checkout <название_ветки>
#                              - переход на указанную веику
# git switch <название_ветки>
# git push origin(название связи) master(название ветки)     отправка версии кода на удаленный репозиторий

# git clone<ссылка_на_удаленный_репозиторий>  склонировать/скопировать/скачать репозиторий
# git remote remove <name>

# hello